///* name 1차원 배열과 score 2차원배열을 이용하여 총점과 평균, 등수를 계산하여 출력하시오


package Book;

import java.util.Arrays;

public class TwoDimenPrac {
  
	public static void main(String[] args) {
	
	

}


	
	String[] name ={
			"강감찬",
			"이성계",
			"홍길도",
			"이진우",
			"조우진",
			"장유진",
			"손영흔"
			};
	
	 int[][]score= {{60,80,60,70,85,0,0,1},
			            {70,90,75,70,80,0,0,1},
			            {90,80,50,60,60,0,0,1},
		                {95,90,85,90,95,0,0,1},
		                {50,65,55,60,70,0,0,1},
		                {65,75,85,64,50,0,0,1},
	                    {75,95,95,95,90,0,0,1}};  
	 
