/* 메소드
 * - 클래스가 수행해야 할 비즈니스 로직을 코드화한 모듈
 * -반환타입이 있는 메소드, 반환타입이 없는 메소드
 * - 접근지정자 void 반환타입 메소드명([매개변수list]){
 *                코드;         
 *    }
 *  -'[매개변수list]' : 매개변수의 선언
 *   
 *   문제1] 다음 조건을 만족하는 원circle 클래스를 구성하시오
 *             멤버변수는 실수타입의 반지름radius와 실수형 상수인 원주율pi=3.1415926
 *          1) 기본 생성자 및 반지름을 정의하는 생성자
 *          2) 현재의 반지름으로 면적을 구하여 반환하는 함수(getArea())
 *   문제2] 원통클래스(cylinder)를 구성하시오
 *          1) 멤버: 높이(실수형)
 *                      문제1에서 구성한 circle타입의 원
 *          2) 메소드 : 부피를 반환하는 실수형 메서드 getVolumn()          
 */
package chapter06;
 

public class MemberEx02 {

}
